
units_name = ('ameba', 'ventilation', 'laboratory', 'mutation' )

cube_pattern = ('пятна', 'полосы')      # узоры амебы
cube_color = ('сине-фиолетовый', 'красно-ораньжевый')  # цвета амебы
cube_eyes = ('один глаз', 'два глаза')  # количество глаз амебы
color_lab = ('желтая', 'красная', 'синяя')  # цвета лабораторий
direct_lab = ('белая(вниз)', 'черная(вверх)')  # цвет стрелки направления движения

lab_color = ('желтая', 'красная', 'синяя')  # цвета лабораторий
lab_list = []

mutations_var = ('сине-фиолетовый', 'красно-ораньжевый'), ('пятна', 'полосы'), ('один глаз', 'два глаза')   # список мутации
mutation_rooms = ('цвет', 'узор', 'глаза')  # названия комнат мутации
mutation_room_list = []

ventilation_list = []

ameba_pattern = ('пятна', 'полосы')      # узоры амебы
ameba_color = ('сине-фиолетовый', 'красно-ораньжевый')  # цвета амебы
ameba_eyes = ('один глаз', 'два глаза')      # количество глаз амебы
ameba_list = []

summ_tiles = 25     # количество тайлов

hint = ('Чтобы отключить подсказку, закомментируй строки с 28 по 30 в play_game.py')

separator = ('----------------------------------------------------------------------------------------------')